<?php

function str_replace_name($name){
		return str_replace(
      array(
        'Á', 'À', 'Â', 'Ä', 'á', 'à', 'ä', 'â', 'ª',
        'É', 'È', 'Ê', 'Ë', 'é', 'è', 'ë', 'ê',
        'Í', 'Ì', 'Ï', 'Î', 'í', 'ì', 'ï', 'î',
        'Ó', 'Ò', 'Ö', 'Ô', 'ó', 'ò', 'ö', 'ô',
        'Ú', 'Ù', 'Û', 'Ü', 'ú', 'ù', 'ü', 'û',
        'Ñ', 'ñ', 'Ç', 'ç'
      ),
      array(
        'A', 'A', 'A', 'A', 'a', 'a', 'a', 'a', 'a',
        'E', 'E', 'E', 'E', 'e', 'e', 'e', 'e',
        'I', 'I', 'I', 'I', 'i', 'i', 'i', 'i',
        'O', 'O', 'O', 'O', 'o', 'o', 'o', 'o',
        'U', 'U', 'U', 'U', 'u', 'u', 'u', 'u',
        'N', 'n', 'C', 'c'
      ),
      $name
    );
   
}
